{
	"token": {
		"I'm Roni":"Olen Roni",
		"Full stack / Front End web developer":"Full stack / Front End web-devaaja",
		"coder":"koodari",
		"or":"tai",
		"nerd":"nörtti",
		"which means some kind of a":"eli ihan vaan",
		"dinosaur in social media age, craft beer enthusiast, music- and movie digger. I build beautiful and functional websites and tweet a lot.":"craft beer -intoilija, musa- ja leffafriikki. Rakennan toimivia verkkosivuja sekä tweettaan paljon.",
		"Please read further to know more.":"Lue lisää tietääksesi enemmän.",
		"Filmgoer":"Leffaihminen.",
		"Digital agency":"Digitoimisto Dude Oy",
		"Entrepreneur.":"Yrittäjä.",
		"My movie blog":"Rollen leffablogi",
		"Craft beer enthusiast.":"Olutharrastaja.",
		"Coder.":"Koodari.",
		"Amstrad CPC was released in 1984 and my father bought it and started to code BASIC, because he was not much of a player but more interested in computing and everything that can be achieved by coding.":"Commodore 64:n ja Sinclairin ZX Spectrumin kilpailija Amstrad julkaisi Amstrad CPC-koneensa vuonna 1984, jonka jälkeen isäni osti koneen ja ryhtyi koodaamaan BASICia, koska ei ollut mikään HC-tietokonepelaaja vaan enemmänkin kiinnostunut mitä kaikkea koneella voi tehdä.",
		"Right before I was born": "Juuri ennen syntymää",
		"I see daylight at the hospital of Central Finland, in the city of Jyväskylä. I born as a healthy son for a young nurse mother and railroad engineer father.": "Näen päivänvalon Keski-Suomen keskussairaalassa, Jyväskylässä. Synnyn terveenä poikana nuorelle sairaanhoitajaäidille ja veturinkuljettajaisälle.",
		"Birth": "Syntymä",
		"I'm introverted soul already in a very young age. When I was four years old I was sitting on the kitchen table and said to my mom": "Olen hieman introvertin suuntaan jo tässä vaiheessa. Ujo ja arka. Jo 4 vuotiaana sanon äidilleni keittiön pöydällä",
		"I'm anxious": "Minua ahdistaa",
		"Peaceful and contemplating child": "Rauhallinen ja mietteliäs lapsi",
		"By the age six I write and read a lot. Writing and reading becomes a dear hobby really quickly.": "Ikävuoteen 6 mennessä kirjoitan ja luen älyttömiä määriä. Kirjoittamisesta tulee heti rakas harrastus.",
		"I get my first computer game as a birthday present from my dad when I am 5 years old. It has multiple thin disks and is so cool. I remember many games vividly, for example Rolling Ronny (whic was my first game). My father had a sense of humor for buying me that game because of the name, and my first internet nickname was ronny later, indeed.": "Saan ensimmäiset tietokonepelini synttärilahjaksi, usealla levykkeellä varustettuna. Näistä mieleen jäi etenkin vuonna 1991 julkaistu Rolling Ronny, isälläni on huumorintajua. Myöhemmin ensimmäisenä nettinickinä olikin \"ronny\".",
		"First computer games": "Ensimmäiset tietokonepelit",
		"I get my first web hosting and webmail with the help of my father. I release my first website. I am about ten years old. The server is still": "Isäni luo minulle ja veljelleni ensimmäisen kotisivutilan ja sähköpostit Nicin palvelimille. Julkaisen ensimmäiset nettisivuni. Olen tuolloin noin kymmenvuotias. Palvelin on pystyssä",
		"online to this day": "tähänkin päivään saakka",
		"My first website": "Ensimmäiset kotisivut",
		"I start playing classical piano. Getting into something else than computers or electronic music for the first time in my life. I take courses on creative writing by Risto Urrio every week and some of my poems are even published in the papers of Central Finland.": "Aloitan pianonsoiton, innostun ensimmäistä kertaa jostain muustakin kuin konemusiikista. Käyn viikottain Risto Urrion kirjailijakerhossa Jyväskylän kirjailijatalolla. Joitakin runojani näkyy jopa Keskisuomalaisessakin.",
		"Creating websites is absolutely favourite thing of mine and I start making them for relatives and their companies for a little fee. I start using IRC and I sign up to": "Nettisivujen väsääminen on kaikista rakkain harrastukseni ja alan tekemään pikkupalkkioista hommia tuttaville. Alan irkkaamaan",
		"I sign up to": "Rekisteröidyn",
		"IRC gallery (one of the first Finnish social medias, a community for IRC users)": "IRC-galleriaan",
		"and": "ja",
		"Myspace": "Myspaceen",
		"Classical piano": "Klassinen piano",
		"Writing": "Kirjoittaminen",
		"Coding": "Koodaaminen",
		"Social media": "Sosiaalinen media",
		"I have already experience in early text, file or sqlite based content management systems such as cutenews and modern CMSs like Textpattern, but until version 2.0 I really get into WordPress and that's the direction I'm taking and staying for good.": "Minulla on jo kokemusta tekstitiedosto-php-pohjaisista sisällönhallintajärjestelmistä, cutenewsistä, sekä moderneista CMSistä kuten Textpattern, mutta vasta version 2.0 myötä innostun toden teolla WordPressistä ja sille tielle jäänkin.",
		"My first WordPress blog": "Ensimmäinen WordPress-sivustoni",
		"is still up and running. Last blog post released in": "on yhä pystyssä. Viimeisin bloggaus kirjoitettu",
		"ago": "sitten",
		"WordPress is released, I start writing even more than before": "WordPress julkaistaan, bloggausinto kasvaa",
		"Skills developing further": "Taidot kehittyy",
		"Last.fm": "Last.fm:ään",
		"I get my Finnish matriculation examination from Cygnaeus in decent grades, only with information technology and creative design I get full points. Even the short math is clearly not my thing, no head for counting.": "Valmistun ylioppilaaksi Cygnaeus-lukiosta kohtalaisin paperein, ainoastaan tietotekniikasta ja kuvamataidosta vedän täysiä pisteitä, lyhyt matematiikka hipoen läpi.",
		"I know that I will not become a true backend programmer, but in web design I think I'm pretty good. In between of coding I get to know a girl on IRC and it's getting more or less serious relationship. I learn she is a deafblind person and I get into sign language, eventually learning it quite fast.": "Tiedän että true backend-ohjelmoijaa minusta ei ainakaan tule, mutta verkkosivuissa olen yhä mielestäni haka. Tutustun Espoosta Jyväskylään muuttaneeseen Veeraan IRCissä ja suhteesta kehkeytyy jotain vakavempaa. Veeran kuurosokeuden myötä opettelen viittomakielen.",
		"Facebook": "Facebookiin",
		"Secondary school graduate": "Ylioppilas",
		"A girlfriend": "Tyttöystävä",
		"Sign language": "Viittomakieli",
		"As soon as I graduate, I go to civil service. In Finland it's compulsory to go to army from age 18, but I refuse and take the punishment-like year of service in facility like non-profit jobs. I get a good job though and go to work at University of Jyväskylä, Department of Computer Science and Information Systems. I learn a lot during that year. Long smoldered depression gets hold on me and I can't face people anymore, so my doctor releases me from the service and I get social anxiety disorder and major depression disorder as diagnoses.": "Pääsen heti lakin saatuani sivariin, jonka suoritan Jyväskylän Yliopiston tietojenkäsittelytieteiden laitoksella. Opin tuon vuoden aikana paljon. Pitkään kytenyt masennus vie palveluskelpoisuuteni ja saan loppuajasta vapautuksen paria erilaista masennukseen liittyvää diagnoosia vastaan.",
		"I'm spending time at home for an indefinite period, but I spend my days coding and mostly blogging, also writing in subjects around": "Jään sosiaalisten tilanteiden pelon aiheuttaman työkyvyttömyyden vuoksi sairaslomalle. Bloggaan paljon myös",
		"civil service": "sivariin",
		"I get engaged with Veera in the Fall and married in the next Summer. However, this and the year before are the hardest of my life so far for many reasons": "liittyvistä aiheista. Menen Veeran kanssa kihloihin ja kesällä naimisiin. Tämä ja edellinen vuosi ovat elämäni vaikeimpia",
		"Civil Service in University of Jyväskylä, Department of Computer Science and Information Systems": "Siviilipalvelus Jyväskylän Yliopistolla",
		"Engagement and wedding": "Kihlaus ja häät",
		"Twitter": "Twitteriin",
		"After being in sick leave for a while, I go to job center for couple of courses and apply to work at Data Group computer store. Everything goes fine, but they are not hiring me as permanent employer. I'm stuck and broke, applying for jobs and not getting any, in the same time getting deeper in my depression and anxiety. I think I don't have any hope.": "Oltuani tovin sairaslomalla, käyn työkkärissä pari kurssia ja haen Jyväskylän Data Group -tietotekniikkaliikkeeseen harjoitteluun. Kaikki sujuu loistavasti, mutta minua ei palkata. Palloilen rahattomana työttömänä hakien töitä, masentuen entisestään. Luulen, että minulla ei ole toivoa.",
		"In the same time my first born daughter is born and I'm happiest guy in the world. I get something else to think, finally.": "Samaan aikaan esikoistyttäreni Lotta Iines syntyy maailmaan ja saan muuta ajateltavaa koti-isänä.",
		"Part-time jobs": "Pätkätyöt",
		"First born daughter is born": "Esikoinen syntyy",
		"I get invited to a job interview to Helsinki. It's a software company that provides a social media-like SaaS service. I'm thrilled, finally something I can do.": "Minut kutsutaan työhaastatteluun Helsinkiin, ohjelmistotaloon, joka toteuttaa sosiaalisen median tyyppistä SaaS-palvelua. Olen innoissani, kerrankin oman alan töitä.",
		"I start in my home town right away. There's more and more jobs in the web design field, I'm seeing that now for the first time, but I still think I'm lucky dude, because I don't have any education in web technologies. However, my employees think that the fact I'm doing so much coding in my freetime is indeed the key here.": "Työpaikka on Jyväskylässä ja pääsen aloittamaan heti. Web-ala nostaa vasta päätään Suomessa, mutta kuvittelen että minulla kävi tuuri, sillä pääsen ylioppilaan papereilla sisään. Päivittäinen harrastuneisuuteni oli kuitenkin avaintekijä.",
		"First real job": "Ensimmäinen oikea työpaikka",
		"I work hard, but long for new challenges. I'm starting to be better considering depression that seems like almost non-existent by now and in the same time I get more self-esteem and start seeing my work good enough and something to be even remotely proud of.": "Teen kovasti töitä, mutta kaipaan uusia haasteita. Olen alkanut parantua masennuksesta, saamaan lisää itsetuntoa ja itseluottamusta sekä kykyä osata olla ylpeä omasta työstään.",
		"Twitter has bought Tweetdeck Inc and apparently finds my": "Twitter on ostanut Tweetdeck-yrityksen ja ilmeisesti huomaa",
		"TweetDeck fork in GitHub": "TweetDeck-forkkini GitHubissa",
		"and I get join the flock invitation from London to go to a job interview. I decline politely, because I have already ideas about my own company": "jonka myötä saan join the flock -kutsun Lontoosta. Kieltäydyn, koska visiot oman yrityksen perustamisesta ovat jo pitkällä",
		"Job offer from Twitter": "Twitter Inc. kutsuu työhaastatteluun",
		"With Juha Laitinen I start a company called": "Perustan Juha Laitisen kanssa",
		"Digitoimisto Dude (a digital agency Dude)": "Digitoimisto Duden",
		"and we start the business right away in the heart of Jyväskylä, Central Finland. And boy it is blooming, because even though we do a lot of contracting in the beginning, we are starting to get good customer base of our own": "ja avaamme heti toiminnan Jyväskylän keskustassa. Homma lähteekin hyvin starttiin alihankinnan kautta ja pian omiakin asiakkuuksia alkaa kertyä",
		"Baby boy Manu is born in August of 2013.": "Manu-poika syntyy elokuussa 2013.",
		"First company": "Ensimmäinen yritys",
		"Digitoimisto Dude is found": "Digitoimisto Dude Oy perustetaan",
		"A son is born": "Poika syntyy",
		"I have successfully delivered over 100 customer projects and at the same time coding SaaS service with colleagues as a side job. The result is Admin Labs, a web based software that notifies user when the web service is slowing down or actually down.": "Olen toteuttanut yli sata asiakasprojektia ja samalla kehittänyt verkkopalvelua, joka ilmoittaa käyttäjää verkkopalvelun hidastumisesta tai kaatumisesta. SaaS-palvelulle perustetaan yritys, Admin Labs Oy.",
		"Second company": "Toinen yritys",
		"Admin Labs is found": "Admin Labs Oy perustetaan",
		"My skillset is growing day by day, I concentrate on making better web and constantly improving my workflow and serving my customers better. I can be found on the internet in many ways": "Kehityn entistä paremman webin tekemiseen, asiakkaiden palvelemiseen parhaalla mahdollisella tavalla. Minut löytää netistä monesta paikkaa",
		"feel free to tweet me if you feel inspired!": "pistä tweettiä jos innosti!",
		"Now and the future": "Nykyhetki ja tulevaisuus",
		"Did you really scrolled and read it all the way to this point? That's so cool! I like to keep myself busy.": "Jaksoit rullata loppuun asti? siistiä! Tykkään pitää itseni kiireisenä.",
		"in my Todoist": "Todoistissani",
		"there's": "on",
		"tasks": "tehtävää",
		"This page was built by Roni \"Rolle\" Laukkarinen by all his knowledge. Fully hand crafted and open source, can be found": "Tämän sivun rakensi tietämyksensä pohjalta puhtaana käsityönä Roni \"Rolle\" Laukkarinen. Koodi on 100% open sourcea ja löytyy",
		"at GitHub": "GitHubista",
		"Last line of code": "Viimeisin rivi koodia",
		"i'm anxious": "minua ahdistaa"
	},
	"regex": [
		["Budget", "งบประมาณ"],
		["^Something at start of text", ""],
		["This will be case insensitive", "i", ""]
	]
}
